uhnp/src/Catalogs/ШаблоныТрансляций/ШаблоныТрансляций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныТрансляций</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПланСчетовИсточник</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовПриемник</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрБухгалтерииИсточник</name>
    <type>
      <types>CatalogRef.РегистрыБухгалтерииБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрБухгалтерииПриемник</name>
    <type>
      <types>CatalogRef.РегистрыБухгалтерииБД</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеТрансляции</name>
    <type>
      <types>EnumRef.НаправленияТрансляцииДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчетаОСВИсточник</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчетаОСВПриемник</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсРегистраИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаЗаполненияИзмеренийПоУмолчанию</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранслироватьСодержаниеПроводок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеРесурсов</name>
    <attributes>
      <name>РесурсИсточник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РесурсПриемник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/НастройкиПравилТрансляции/НастройкиПравилТрансляции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПравилТрансляции</name>
  <resources>
    <name>ИспользованиеДт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользованиеКт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименениеПоКорреспонденции</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоррСчетИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьСальдо</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТранслироватьОбороты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриоритетТрансляции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ШаблонТрансляции</name>
    <type>
      <types>CatalogRef.ШаблоныТрансляций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоответствиеСчетов</name>
    <type>
      <types>CatalogRef.СоответствияСчетовДляТрансляции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/НаправленияТрансляцииДанных/НаправленияТрансляцииДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияТрансляцииДанных</name>
  <enumValues>
    <name>ПоказателиВПоказатели</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерииВПоказатели</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерииВРегистрБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>ФинансовыеРегистрыВРегистрБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерииВПоказателиБДДС</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерииВПоказателиБДР</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерииВПоказателиРесурсы</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ВидыОтчетов/ВидыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОтчетов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидАналитики1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики6</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоАналитик</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктуальныйШаблон</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрБухгалтерии</name>
    <type>
      <types>CatalogRef.РегистрыБухгалтерииБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьЗабалансовыеСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФормироватьАналитическиеРаскрытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыводитьГруппирующиеСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СокращеннаяОСВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучатьБухгалтерскиеИтогиПоГруппирующимСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРакурсы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникБД</name>
    <type>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьПоСтруктуреСправочника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожетИспользоватьсяДляУстановкиЛимитов</name>
    <comment>ОПК</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсРегистраИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектДляСогласованияЗначений</name>
    <type>
      <types>EnumRef.ОбъектыСогласованияЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоВыбраннымСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаФормированияФормул</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулыДляНачальныхСальдо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОтчета</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВидыИтоговПоСчетам</name>
    <attributes>
      <name>ВидИтогаПоСчету</name>
      <type>
        <types>EnumRef.ВидыБухгалтерскихИтогов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыУстановкиЛимитов</name>
    <comment>ОПК</comment>
    <attributes>
      <name>КолонкаОтчета</name>
      <comment>ОПК</comment>
      <type>
        <types>CatalogRef.КолонкиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Предназначение</name>
      <comment>ОПК</comment>
      <type>
        <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеСчета</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетИспользуется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ШаблоныТрансляций/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ОбновитьТаблицуРесурсов()
	
	Объект.СоответствиеРесурсов.Очистить();
	ЗаполнитьСписокРесурсовПриемник();
	
	Для Каждого СтрРесурс ИЗ Объект.РегистрБухгалтерииИсточник.Ресурсы Цикл
		
		НоваяСтрока=Объект.СоответствиеРесурсов.Добавить();
		НоваяСтрока.РесурсИсточник=СтрРесурс.Имя;
		
		СтрокаПриемник=Объект.РегистрБухгалтерииПриемник.Ресурсы.Найти(СтрРесурс.ПризнакУчета,"ПризнакУчета");
		
		Если (Не СтрокаПриемник=Неопределено) И Объект.СоответствиеРесурсов.НайтиСтроки(Новый Структура("РесурсПриемник",СтрокаПриемник.Имя)).Количество()=0 Тогда
				
			НоваяСтрока.РесурсПриемник=СтрокаПриемник.Имя;
			
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры // ОбновитьТаблицуРесурсов()

&НаСервере
Процедура ОбновитьТаблицуРесурсовФинансовыхРегистров()
	
	Объект.СоответствиеРесурсов.Очистить();
	ЗаполнитьСписокРесурсовПриемник();
	
	НоваяСтрока=Объект.СоответствиеРесурсов.Добавить();
	НоваяСтрока.РесурсИсточник="СуммаРегл";
	НоваяСтрока.РесурсПриемник="СуммаВВалютеУчета";
	
	НоваяСтрока=Объект.СоответствиеРесурсов.Добавить();
	НоваяСтрока.РесурсИсточник="СуммаУпр";
	НоваяСтрока.РесурсПриемник="СуммаВВалютеОтчетности";
	
	НоваяСтрока=Объект.СоответствиеРесурсов.Добавить();
	НоваяСтрока.РесурсИсточник="ВалютнаяСумма";
	НоваяСтрока.РесурсПриемник="СуммаВВалюте";
	
	НоваяСтрока=Объект.СоответствиеРесурсов.Добавить();
	НоваяСтрока.РесурсИсточник="Количество";
	НоваяСтрока.РесурсПриемник="Количество";
	
КонецПроцедуры // ОбновитьТаблицуРесурсовФинансовыхРегистров() 

&НаСервере
Процедура ОбновитьТаблицуРесурсовБюджетов()
	
	ЗаполнитьСписокРесурсовПриемник();	
		
	Для Каждого СтрРесурс ИЗ Объект.РегистрБухгалтерииИсточник.Ресурсы Цикл
		
		Если СтрРесурс.Балансовый
			ИЛИ СтрРесурс.ПризнакУчета="Количественный" Тогда
			
			НоваяСтрока=Объект.СоответствиеРесурсов.Добавить();
			НоваяСтрока.РесурсИсточник=СтрРесурс.Имя;
			
		КонецЕсли;
		
	КонецЦикла;
					
КонецПроцедуры // ОбновитьТаблицуРесурсов()

&НаСервере
Процедура ПриИзмененииРегистра()
	
	Если ЗаполненыРеквизитыТрансляцииПроводок() Тогда
		
		ОбновитьТаблицуРесурсов();
		Элементы.ГруппаСоответствиеРесурсов.Видимость=Истина;
		Элементы.ГруппаЗаполнениеИзмерений.Видимость=Истина;
		ПолучитьНастройкиЗаполненияИзмеренийПоУмолчанию();
		
	ИначеЕсли Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.ФинансовыеРегистрыВРегистрБухгалтерии 
		И ЗначениеЗаполнено(Объект.РегистрБухгалтерииПриемник) Тогда
		
		ОбновитьТаблицуРесурсовФинансовыхРегистров();
		Элементы.ГруппаСоответствиеРесурсов.Видимость=Истина;
		Элементы.ГруппаЗаполнениеИзмерений.Видимость=Ложь;
				
	Иначе
		
		Элементы.ГруппаСоответствиеРесурсов.Видимость=Ложь;
		Элементы.ГруппаЗаполнениеИзмерений.Видимость=Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииРегистраПриемник()

&НаСервере
Функция ЗаполненыРеквизитыТрансляцииПроводок()
	
	Возврат Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.РегистрБухгалтерииВРегистрБухгалтерии
		И ЗначениеЗаполнено(Объект.РегистрБухгалтерииИсточник)
		И ЗначениеЗаполнено(Объект.РегистрБухгалтерииПриемник)
		
КонецФункции // УстановитьВидимостьДополнительныхНастроек()

&НаСервере
Функция ЕстьСоответствиеРесурсов()

	Возврат (Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.РегистрБухгалтерииВРегистрБухгалтерии
			ИЛИ Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.ФинансовыеРегистрыВРегистрБухгалтерии);
	
КонецФункции // ЕстьСоответствиеРесурсов() 	

&НаСервере
Процедура ПолучитьНастройкиЗаполненияИзмеренийПоУмолчанию()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Записать();
		
	КонецЕсли;
	
	Объект.НастройкаЗаполненияИзмеренийПоУмолчанию=Справочники.ИсточникиДанныхДляРасчетов.ПолучитьИсточникДляЗаполненияИзмерений(Объект.Ссылка,Объект.РегистрБухгалтерииИсточник,Объект.РегистрБухгалтерииПриемник);
		
КонецПроцедуры // ПолучитьНастройкиЗаполненияИзмеренийПоУмолчанию()  
 
&НаСервере
Процедура ПриИзмененииПланаСчетов(Приемник=Ложь)
	
	ОбъектКопирования=Неопределено;
	
	Если Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.ПоказателиВПоказатели Тогда
		
		УстановитьВидОтчетаОСВ(Приемник);
		Возврат;
				
	КонецЕсли;
				
	Если Приемник Тогда
		
		Если Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.РегистрБухгалтерииВПоказатели Тогда
			
			УстановитьВидОтчетаОСВ(Приемник);
			Возврат;
			
		КонецЕсли;	
					
		МассивРегистров=УправлениеОтчетамиУХ.ПолучитьМассивРегистровБухгалтерии(Объект.ПланСчетовПриемник);
		
		Если МассивРегистров.Количество()>0 Тогда 
			
			Объект.РегистрБухгалтерииПриемник=МассивРегистров[0];
			ПриИзмененииРегистра();
			
		Иначе
			
			ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрШаблон(Нстр("ru = 'Отсутствует описание регистра бухгалтерии для выбранного плана счетов:%1'"), 
			Объект.ПланСчетовПриемник.Наименование),,,СтатусСообщения.Внимание);
			Возврат;
			
		КонецЕсли; 
		
	Иначе
		
		МассивРегистров=УправлениеОтчетамиУХ.ПолучитьМассивРегистровБухгалтерии(Объект.ПланСчетовИсточник);
		
		Если МассивРегистров.Количество()>0 Тогда 
			
			Объект.РегистрБухгалтерииИсточник=МассивРегистров[0];
			ПриИзмененииРегистра();
			
		Иначе
			
			ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрШаблон(Нстр("ru = 'Отсутствует описание регистра бухгалтерии для выбранного плана счетов:%1'"), 
			Объект.ПланСчетовИсточник.Наименование),,,СтатусСообщения.Внимание);
			Возврат;
			
		КонецЕсли; 
		
		Если НЕ Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.ПоказателиВПоказатели Тогда
						
			ОбщегоНазначенияСерверУХ.ОбновитьСписокРесурсовРегистра(Объект.РегистрБухгалтерииИсточник,Объект.РесурсРегистраИсточник,Элементы.РесурсРегистраИсточник);
			
		КонецЕсли;
				
	КонецЕсли;	
	
КонецПроцедуры // ПриИзмененииПланаСчетов()

&НаСервере
Процедура УстановитьВидОтчетаОСВ(Приемник)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ВидыОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыОтчетов КАК ВидыОтчетов
	|ГДЕ
	|	ВидыОтчетов.ПланСчетов = &ПланСчетов
	|	И ВидыОтчетов.ИспользоватьПоУмолчанию";
	
	Если Приемник Тогда
		
		Запрос.УстановитьПараметр("ПланСчетов",Объект.ПланСчетовПриемник);
		Результат=Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			
			Объект.ВидОтчетаОСВПриемник=Результат.Ссылка;
			
		КонецЕсли;
		
	Иначе
		
		Запрос.УстановитьПараметр("ПланСчетов",Объект.ПланСчетовИсточник);
		Результат=Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			
			Объект.ВидОтчетаОСВИсточник=Результат.Ссылка;
			
		КонецЕсли; 
		
		Если НЕ Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.ПоказателиВПоказатели Тогда
			
			ОбщегоНазначенияСерверУХ.ОбновитьСписокРесурсовРегистра(Объект.РегистрБухгалтерииИсточник,Объект.РесурсРегистраИсточник,Элементы.РесурсРегистраИсточник);
			
		КонецЕсли;
		
	КонецЕсли;  		
	
КонецПроцедуры // УстановитьВидОтчетаОСВ()
 	
&НаКлиенте
Процедура СопоставлениеСчетов_Завершение(Результат, Параметры) Экспорт
	// Обработка выбора пользователя.
	РазрешатьОткрытие = Истина;
    Если Результат = КодВозвратаДиалога.Да Тогда
		Попытка
			Записать();
		Исключение
			ТекстСообщения = НСтр("ru = 'При записи шаблона трансляции %Ссылка% возникли ошибки: %ОписаниеОшибки%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Строка(Объект.Ссылка));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РазрешатьОткрытие = Ложь;
		КонецПопытки;
    ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    Иначе       
		ТекстСообщения = НСтр("ru = 'Выбран неизвестный вариант: %ВыбранноеЗначение%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВыбранноеЗначение%", Строка(Результат));
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецЕсли;
	// Открытие формы сопоставления счетов.
	Если (РазрешатьОткрытие) И (ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		СтруктураПараметровФормы = Новый Структура;
		СтруктураПараметровФормы.Вставить("ШаблонТрансляции", Объект.Ссылка);
		ОткрытьФормуНастройкиСопоставления();
	Иначе
		ТекстСообщения = НСтр("ru = 'Операция сопоставления отменена.'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеСчетов(Команда)
	
	Если Параметры.Ключ.Пустая() ИЛИ Модифицированность Тогда
		
		СтруктураПараметров = Новый Структура;
		ТекстВопроса = НСтр("ru = 'Шаблон трансляции еще не записан. Записать?'");
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("СопоставлениеСчетов_Завершение", ЭтаФорма, СтруктураПараметров);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
		Возврат;

	КонецЕсли;	
	
	ОткрытьФормуНастройкиСопоставления();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьФормуНастройкиСопоставления()
	
	ФормаТрансляцияРегистров="Обработка.УстановкаСоответствияРегистров.Форма";
	НаправлениеТрансляцияРегистров="Перечисление.НаправленияТрансляцииДанных.ФинансовыеРегистрыВРегистрБухгалтерии";
	
	Если Объект.НаправлениеТрансляции=ПредопределенноеЗначение(НаправлениеТрансляцияРегистров) Тогда
		
		ОткрытьФорму(ФормаТрансляцияРегистров, Новый Структура("ШаблонТрансляции", Объект.Ссылка));	
		
	Иначе
		
		ОткрытьФорму("Обработка.УстановкаСоответствияСчетов.Форма", Новый Структура("ШаблонТрансляции", Объект.Ссылка));
		
	КонецЕсли;
		
КонецПроцедуры // ОткрытьФормуНастройкиСопоставления()

&НаКлиенте
Процедура ПланСчетовИсточникПриИзменении(Элемент)
	
	ПриИзмененииПланаСчетов(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланСчетовПриемникПриИзменении(Элемент)
	
	ПриИзмененииПланаСчетов(Истина);
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокРесурсовПриемник()
	
	Элементы.РесурсПриемник.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Объект.РегистрБухгалтерииПриемник) Тогда
		
		Для Каждого СтрРесурс ИЗ Объект.РегистрБухгалтерииПриемник.Ресурсы Цикл
			
			Элементы.РесурсПриемник.СписокВыбора.Добавить(СтрРесурс.Имя,СтрРесурс.Синоним);
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры // ЗаполнитьСписокРесурсовПриемник() 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокРесурсовПриемник();
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		ОбъектКопирования=Параметры.ЗначениеКопирования;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
		
		Элементы.ВидОтчетаОСВПриемник.Доступность=Ложь;
		Элементы.НаправлениеТрансляции.Видимость=Ложь;
		
	ИначеЕсли Параметры.Свойство("ВидОтчета") Тогда
		
		Объект.ВидОтчетаОСВПриемник=Параметры.ВидОтчета;
		Объект.НаправлениеТрансляции=Параметры.НаправлениеТрансляции;
		
	КонецЕсли;
			
	Элементы.НаправлениеТрансляции.СписокВыбора.Добавить(Перечисления.НаправленияТрансляцииДанных.ПоказателиВПоказатели);
	Элементы.НаправлениеТрансляции.СписокВыбора.Добавить(Перечисления.НаправленияТрансляцииДанных.РегистрБухгалтерииВПоказатели);
	Элементы.НаправлениеТрансляции.СписокВыбора.Добавить(Перечисления.НаправленияТрансляцииДанных.РегистрБухгалтерииВРегистрБухгалтерии);
				
	Если ОбщегоНазначения.ПодсистемаСуществует("ИзмененныеОбъектыЕХ") Тогда
		
		Элементы.НаправлениеТрансляции.СписокВыбора.Добавить(Перечисления.НаправленияТрансляцииДанных.ФинансовыеРегистрыВРегистрБухгалтерии);

	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.НаправлениеТрансляции) Тогда
		
		Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.РегистрБухгалтерииВРегистрБухгалтерии;
				
	КонецЕсли; 
	
	Элементы.ДекорацияРегистры.Заголовок=Нстр("ru = 'Финансовые регистры'");
		
	УстановитьВидимость();
			
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ОбъектКопирования) Тогда
		
		УправлениеОтчетамиУХ.ПеренестиНастройкиСоответствияСчетов(ОбъектКопирования,Объект.Ссылка);
		ОбъектКопирования=Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ВидОтчетаОСВИсточник.Видимость=(Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.ПоказателиВПоказатели);
	Элементы.ВидОтчетаОСВПриемник.Видимость=ТрансляцияВПоказателиОтчетов();											
											
	Элементы.ГруппаЗаполнениеИзмерений.Видимость	= ЗаполненыРеквизитыТрансляцииПроводок(); 
	Элементы.ГруппаСоответствиеРесурсов.Видимость=ЕстьСоответствиеРесурсов();
	Элементы.НаправлениеТрансляции.Видимость		= ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом();
	Элементы.РесурсРегистраИсточник.Видимость		= Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.РегистрБухгалтерииВПоказатели;

	Элементы.ПланСчетовИсточник.Видимость=(НЕ Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.ФинансовыеРегистрыВРегистрБухгалтерии);
	Элементы.ДекорацияРегистры.Видимость=НЕ Элементы.ПланСчетовИсточник.Видимость; 
	
	Элементы.ВидОтчетаОСВПриемник.Доступность=Элементы.НаправлениеТрансляции.Видимость;
	
	Элементы.ГруппаПланыСчетов.ТолькоПросмотр=ЕстьСоответствияСчетов();
	
КонецПроцедуры // УстановитьВидимость() 

&НаСервере
Функция ЕстьСоответствияСчетов()
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	НастройкиПравилТрансляции.СоответствиеСчетов КАК СоответствиеСчетов
	             |ИЗ
	             |	РегистрСведений.НастройкиПравилТрансляции КАК НастройкиПравилТрансляции
	             |ГДЕ
	             |	НастройкиПравилТрансляции.ШаблонТрансляции = &ШаблонТрансляции";
	
	Запрос.УстановитьПараметр("ШаблонТрансляции",Объект.Ссылка);
	Результат=Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
		
КонецФункции // ЕстьСоответствияСчетов()   

&НаСервере
Функция ТрансляцияВПоказателиОтчетов()
	
	Возврат Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.ПоказателиВПоказатели
		ИЛИ Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.РегистрБухгалтерииВПоказатели;
	
КонецФункции // ТрансляцияВПоказателиОтчетов() 
	
	


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.НаправлениеТрансляции=ПредопределенноеЗначение("Перечисление.НаправленияТрансляцииДанных.ПоказателиВПоказатели") Тогда	
		
		Если НЕ ЗначениеЗаполнено(Объект.ВидОтчетаОСВПриемник) Тогда
			
			ПоказатьПредупреждение(,Нстр("ru = 'Приемник: не указана оборотно - сальдовая ведомость.'"));
			Отказ=Истина;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ВидОтчетаОСВИсточник) Тогда
			
			ПоказатьПредупреждение(,Нстр("ru = 'Источник: не указана оборотно - сальдовая ведомость.'"));
			Отказ=Истина;
			
		КонецЕсли;
	
	ИначеЕсли Объект.НаправлениеТрансляции=ПредопределенноеЗначение("Перечисление.НаправленияТрансляцииДанных.РегистрБухгалтерииВПоказатели") Тогда 
		
		Если НЕ ЗначениеЗаполнено(Объект.ВидОтчетаОСВПриемник) Тогда
			
			ПоказатьПредупреждение(,Нстр("ru = 'Приемник: не указана оборотно - сальдовая ведомость.'"));
			Отказ=Истина;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Процедура ПриИзмененииНаправленияТрансляции() 

	Если Объект.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.ФинансовыеРегистрыВРегистрБухгалтерии Тогда
		
		ОбновитьТаблицуРесурсовФинансовыхРегистров();
		
	КонецЕсли;
	
	Объект.ВидОтчетаОСВПриемник="";
	УстановитьВидимость();	
	
КонецПроцедуры // ПриИзмененииНаправленияТрансляции() 

&НаКлиенте
Процедура НаправлениеТрансляцииПриИзменении(Элемент)
	
	ПриИзмененииНаправленияТрансляции();
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКорректности(Команда)
	
	ОткрытьФорму("Обработка.ПроверкаКорректностиОписанияМетаданных.Форма",Новый Структура("ОбъектДляПроверки",Объект.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЗаполненияИзмеренийПоУмолчаниюОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.НастройкаЗаполненияИзмеренийПоУмолчанию) Тогда
		
		СтандартнаяОбработка=Ложь;
		ПолучитьНастройкиЗаполненияИзмеренийПоУмолчанию();
		ПоказатьЗначение(,Объект.НастройкаЗаполненияИзмеренийПоУмолчанию);
		
	КонецЕсли;
	
КонецПроцедуры
